; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l10-t1-p2---int100n150-m25---int100c110---s85---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level40 level22 level62)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level19 level62)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level15 level62)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level59 level3 level62)

(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l0 l9)
(fuelcost level20 l0 l9)
(connected l1 l3)
(fuelcost level6 l1 l3)
(connected l1 l4)
(fuelcost level6 l1 l4)
(connected l1 l6)
(fuelcost level22 l1 l6)
(connected l1 l8)
(fuelcost level15 l1 l8)
(connected l1 l9)
(fuelcost level3 l1 l9)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l3)
(fuelcost level23 l2 l3)
(connected l2 l6)
(fuelcost level3 l2 l6)
(connected l2 l8)
(fuelcost level8 l2 l8)
(connected l2 l9)
(fuelcost level16 l2 l9)
(connected l3 l1)
(fuelcost level6 l3 l1)
(connected l3 l2)
(fuelcost level23 l3 l2)
(connected l3 l5)
(fuelcost level4 l3 l5)
(connected l4 l1)
(fuelcost level6 l4 l1)
(connected l4 l6)
(fuelcost level4 l4 l6)
(connected l5 l3)
(fuelcost level4 l5 l3)
(connected l5 l6)
(fuelcost level19 l5 l6)
(connected l6 l1)
(fuelcost level22 l6 l1)
(connected l6 l2)
(fuelcost level3 l6 l2)
(connected l6 l4)
(fuelcost level4 l6 l4)
(connected l6 l5)
(fuelcost level19 l6 l5)
(connected l6 l7)
(fuelcost level21 l6 l7)
(connected l7 l6)
(fuelcost level21 l7 l6)
(connected l8 l1)
(fuelcost level15 l8 l1)
(connected l8 l2)
(fuelcost level8 l8 l2)
(connected l9 l0)
(fuelcost level20 l9 l0)
(connected l9 l1)
(fuelcost level3 l9 l1)
(connected l9 l2)
(fuelcost level16 l9 l2)

(at t0 l7)
(fuel t0 level62)
(= (total-cost) 0)

(at p0 l8)
(at p1 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l6)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l7 l6 level41 level21 level62)
   deleted: (at t0 l7) (fuel t0 level62)
   added: (at t0 l6) (fuel t0 level41)
   goals met: 0 of 2
2. (drive t0 l6 l2 level38 level3 level41)
   deleted: (at t0 l6) (fuel t0 level41)
   added: (at t0 l2) (fuel t0 level38)
   goals met: 0 of 2
3. (drive t0 l2 l8 level30 level8 level38)
   deleted: (at t0 l2) (fuel t0 level38)
   added: (at t0 l8) (fuel t0 level30)
   goals met: 0 of 2
4. (load p0 t0 l8)
   deleted: (at p0 l8)
   added: (in p0 t0)
   goals met: 0 of 2
5. (drive t0 l8 l1 level15 level15 level30)
   deleted: (at t0 l8) (fuel t0 level30)
   added: (at t0 l1) (fuel t0 level15)
   goals met: 0 of 2
6. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 2
7. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 2
8. (drive t0 l1 l4 level9 level6 level15)
   deleted: (at t0 l1) (fuel t0 level15)
   added: (at t0 l4) (fuel t0 level9)
   goals met: 1 of 2
9. (drive t0 l4 l6 level5 level4 level9)
   deleted: (at t0 l4) (fuel t0 level9)
   added: (at t0 l6) (fuel t0 level5)
   goals met: 1 of 2
10. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 2 of 2
